{
  "id": "en",
  "homePage": {
    "name": "Hi, my name is Oleksandr Holyshevskyi",
    "about": "I'm a certificated Test Automation Engineer based in Ukraine. I am dedicated to improving the experiences of both people and customers alike, using my skills to deliver top-notch results that drive success.",
    "recentPosts": {
      "later_1": "R",
      "title": "ecent posts",
      "minRead": "min read",
      "readMore": "Read more"
    }
  },
  "about": {
    "later_1": "A",
    "title": "bout",
    "aboutMe": "As a Test Automation Engineer I possess a strong passion for both technology and serving my clients. My unwavering energy and dedication to ensuring the best experience for my customers is reflected in my work as a skilled professional who designs, develops and executes automated tests to enhance software quality. With a focus on delivering top-notch results, I am a valuable asset to any team.",
    "downloadCV": {
      "download": "Download CV",
      "downloading": "Downloading...",
      "downloaded": "Downloaded"
    },
    "aboutAccordion": {
      "experience": {
        "title": "My experience",
        "TechStudioJob": {
          "companyName": "TechStudio",
          "occupation": "As a QA Engineer on the IPTV project for mobile platforms iOS and Android, I have honed my skills in quality assurance and testing. I have created test cases and other testing artifacts, and have been responsible for testing both the frontend and backend of the application. Additionally, I have taken steps to improve the efficiency of our testing processes by starting to develop automated tests for the API using C#. My experience in this role has also allowed me to share my knowledge and mentor newcomers in the team, contributing to the growth and success of the company."
        },
        "PasynSoftJob": {
          "companyName": "PasynSoft LLC",
          "occupation": "Extensive experience on web application projects, I bring a strong technical knowledge to the table. My proficiency in using C# and TypeScript for writing automated tests has allowed me to effectively test and validate software functionality. Additionally, my experience with Selenium and the Playwright library has equipped me with the tools and skills necessary to create comprehensive test suites and ensure the highest level of software quality. In addition to my strong skills in C# and TypeScript, I am also well-versed in a range of other technologies, including JavaScript, NodeJS, SQL, Git, and Azure DevOps. These technical proficiencies have allowed me to effectively design, develop, and execute automated tests for web applications, and have equipped me with the ability to integrate my tests into a larger development workflow."
        },
        "AdvantISSJob": {
          "companyName": "AdvantISS",
          "occupation": "As a Test Automation Engineer, I specialize in C# and TypeScript to create automated test scripts using Playwright and Selenium libraries. My strengths include building customized test frameworks tailored to project needs. I've worked on diverse projects, gaining adaptability and in-depth knowledge of software development processes. Additionally, I've mentored junior team members, sharing knowledge and ensuring high-quality results. I excel in essential tasks such as test case design and execution, contributing to project success through technical expertise and attention to detail."
        }
      },
      "education": {
        "title": "Education",
        "university": "Sumy State University",
        "masterDegree": "Master's degree, Material science",
        "bachelorDegree": "Bachelor's degree, Material science"
      },
      "skills": {
        "title": "Skills",
        "skillsDescription": {
          "c#": "I have honed my expertise in leveraging C# and TypeScript programming languages to create robust and efficient automated test scripts",
          "typescript": "I have honed my expertise in leveraging C# and TypeScript programming languages to create robust and efficient automated test scripts",
          "playwright": "My work revolves around ensuring the reliability and accuracy of software applications by employing the Playwright and Selenium libraries",
          "selenium": "My work revolves around ensuring the reliability and accuracy of software applications by employing the Playwright and Selenium libraries",
          "git": "I effectively use Git for version control, ensuring collaborative development and tracking changes in the test automation codebase",
          "api": "I have hands-on experience with API testing using tools like POSTMAN, enabling thorough verification of RESTful services and API endpoints",
          "postman": "Postman allows me to create and execute API requests, including GET, POST, PUT, DELETE, and more which is helpful in API testing",
          "sql": "My role involves working with SQL to perform database testing, validating data integrity, and ensuring that the application interacts correctly with databases",
          "nodejs": "I have leveraged Node.js to enhance automation scripts and testing frameworks, improving their efficiency and performance",
          "docker": "I have practical experience with Docker, allowing me to create and manage containerized environments for testing, promoting consistency and repeatability in testing setups",
          "scrum": "Worked within Agile Scrum methodologies, contributing to sprint planning, backlog refinement, and daily stand-up meetings for efficient project management",
          "jira": "Proficient in Jira for tracking and managing project tasks, defects, and user stories, ensuring alignment with project goals",
          "staticTesting": "I have contributed to static testing efforts, identifying and documenting defects in the early stages of development, resulting in reduced software maintenance costs and improved overall quality",
          "softwareTesting": "Contributed to the overall improvement of software quality by identifying defects and issues, reducing manual testing efforts, and ensuring the timely delivery of high-quality software products"
        }
      },
      "certificates": {
        "title": "Certificates",
        "id": "Credential Id",
        "skills": "Skills"
      }
    }
  },
  "blogPage": {
    "later_1": "B",
    "title": "log",
    "searchInputPlaceholder": "Search post...",
    "all": "All",
    "filterByTags": "Filter by tags",
    "resetFilter": "Reset filter",
    "allPosts": "All posts",
    "noPosts": "No posts were found."
  },
  "header": {
    "name": "Oleksandr Holyshevskyi",
    "navItems": {
      "home": "Home",
      "about": "About",
      "blog": "Blog",
      "newPostBadge": "new"
    }
  },
  "footer": {
    "powered": "Powered by",
    "deployed": "deployed on",
    "designed": "designed with"
  },
  "postCards": {
    "minRead": "min read",
    "inThePost": "In the post",
    "readMore": "Read more",
    "views": {
      "single": "view",
      "plural": "views"
    }
  },
  "postPage": {
    "tocHeader": "In this article",
    "sharedLinks": "Share with ",
    "copyLink": "Copy link",
    "later_1": "R",
    "relatedPosts": "elated topics",
    "backToHome": "Back to home",
    "toTop": "To Top"
  },
  "filteredPosts": {
    "later_1": "P",
    "title": "osts filtered by: "
  },
  "metadata": {
    "homePage": "Oleksandr Holyshevskyi",
    "aboutPage": "About",
    "blogPage": "Blog",
    "filteredPage": "All by - {tag}"
  },
  "recommendations": {
    "title": "Recommendations",
    "1st": {
      "name": "Denys Hannych",
      "position": "Denys worked with me on the same team"
    },
    "2nd": {
      "name": "Yana Kyrychenko",
      "position": "Yana managed me directly"
    }
  },
  "statistic": {
    "title": "Annual statistic",
    "bugReports": {
      "title": "Total bug reports created", 
      "tooltip": "Deployed bugs with fixed defects"
    },
    "tasks": {
      "title": "Total tasks completed", 
      "tooltip": "Tasks tested/verified/delivered"
    },
    "commits": {
      "title": "Total commits", 
      "tooltip": "Commit messages in test frameworks"
    },
    "tests": {
      "title": "Total tests created", 
      "tooltip": "Completed e2e/integration tests"
    }
  }
}