{
  "id": "uk",
  "homePage": {
    "name": "Вітаю, мене звати Олександр Голишевський",
    "about": "Я - сертифікований інженер з автоматизації тестування, проживаю в Україні. Я відданий справі покращення досвіду як людей, так і клієнтів, використовуючи свої навички для досягнення першокласних результатів, які сприяють успіху.",
    "recentPosts": {
      "later_1": "О",
      "title": "станні публікації",
      "minRead": "хв читання",
      "readMore": "Читати"
    }
  },
  "about": {
    "later_1": "П",
    "title": "ро мене",
    "aboutMe": "Як інженер з автоматизації випробувань я маю сильну пристрасть як до технологій, так і до обслуговування своїх клієнтів. Моя непохитна енергія та відданість справі забезпечення найкращого досвіду для моїх клієнтів відображена в моїй роботі як кваліфікованого професіонала, який проектує, розробляє та виконує автоматизовані тести для підвищення якості програмного забезпечення. Оскільки я зосереджений на досягненні найвищих результатів, я є цінним активом для будь-якої команди.",
    "downloadCV": {
      "download": "Завантажити CV",
      "downloading": "Завантаження...",
      "downloaded": "Завантажено"
    },
    "aboutAccordion": {
      "experience": {
        "title": "Мій досвід",
        "TechStudioJob": {
          "companyName": "TechStudio",
          "occupation": "Як інженер із забезпечення якості в проекті IPTV для мобільних платформ iOS і Android, я відточив свої навички щодо забезпечення якості та тестування. Я створював тестові приклади та інші артефакти тестування, і відповідав за тестування інтерфейсу, і серверу програми. Крім того, я вжив заходів для підвищення ефективності наших процесів тестування, почавши розробляти автоматизовані тести для API за допомогою C#. Мій досвід роботи на цій посаді також дозволив мені ділитися своїми знаннями та наставляти новачків у команді, сприяючи зростанню та успіху компанії."
        },
        "PasynSoftJob": {
          "companyName": "PasynSoft LLC",
          "occupation": "Великий досвід роботи над проектами веб-додатків, я вношу сильні технічні знання. Мій досвід використання C# і TypeScript для написання автоматизованих тестів дозволив мені ефективно тестувати та перевіряти функціональність програмного забезпечення. Крім того, мій досвід роботи з Selenium і бібліотекою Playwright дав мені інструменти та навички, необхідні для створення комплексних наборів тестів і забезпечення найвищого рівня якості програмного забезпечення. Окрім моїх сильних навичок у C# та TypeScript, я також добре знаю низку інших технологій, зокрема JavaScript, NodeJS, SQL, Git та Azure DevOps. Ці технічні знання дозволили мені ефективно проектувати, розробляти та виконувати автоматичні тести для веб-додатків, а також дали мені можливість інтегрувати свої тести в більший робочий процес розробки."
        },
        "AdvantISSJob": {
          "companyName": "AdvantISS",
          "occupation": "Як інженер з автоматизації тестування я спеціалізуюся на C# та TypeScript для створення сценаріїв автоматизованого тестування за допомогою бібліотек Playwright і Selenium. Мої сильні сторони включають створення індивідуальних тестових інфраструктур, адаптованих до потреб проекту. Я працював над різноманітними проектами, отримавши адаптивність і глибокі знання процесів розробки програмного забезпечення. Крім того, я наставляв молодших членів команди, ділився знаннями та забезпечував високоякісні результати. Я чудово виконую важливі завдання, такі як розробка та виконання тестів, сприяю успіху проекту завдяки технічним знанням і уважності до деталей."
        }
      },
      "education": {
        "title": "Освіта",
        "university": "Сумський Державний університет (СумДУ)",
        "masterDegree": "Магістр, матеріалознавство",
        "bachelorDegree": "Ступінь бакалавра, Матеріалознавство"
      },
      "skills": {
        "title": "Навички",
        "skillsDescription": {
          "c#": "Я відточив свій досвід у використанні мов програмування C# і TypeScript для створення надійних і ефективних автоматизованих сценаріїв тестування",
          "typescript": "Я відточив свій досвід у використанні мов програмування C# і TypeScript для створення надійних і ефективних автоматизованих сценаріїв тестування",
          "playwright": "Моя робота полягає в тому, щоб забезпечити надійність і точність програмного забезпечення за допомогою бібліотек Playwright і Selenium",
          "selenium": "Моя робота полягає в тому, щоб забезпечити надійність і точність програмного забезпечення за допомогою бібліотек Playwright і Selenium",
          "git": "Я ефективно використовую Git для контролю версій, забезпечення спільної розробки та відстеження змін у кодовій базі автоматизації тестування",
          "api": "Я маю практичний досвід тестування API за допомогою таких інструментів, як POSTMAN, що дозволяє ретельно перевіряти служби RESTful і кінцеві точки API",
          "postman": "Postman дозволяє мені створювати та виконувати запити API, зокрема GET, POST, PUT, DELETE тощо, що корисно під час тестування API",
          "sql": "Моя роль включає роботу з SQL для тестування бази даних, перевірки цілісності даних і забезпечення правильної взаємодії програми з базами даних",
          "nodejs": "Я використовую Node.js для вдосконалення сценаріїв автоматизації та тестових інфраструктур, покращуючи їх ефективність і продуктивність",
          "docker": "У мене є практичний досвід роботи з Docker, який дозволяє мені створювати та керувати контейнерними середовищами для тестування, сприяючи узгодженості та повторюваності в налаштуваннях тестування",
          "scrum": "Працюю із методологіями Agile Scrum, сприяючи плануванню спринтів, уточненню резервів і щоденним зустрічам для ефективного управління проектами",
          "jira": "Досвідчене володіння Jira для відстеження та керування проектними завданнями, дефектами та історіями користувачів, забезпечуючи узгодженість із цілями проекту",
          "staticTesting": "Я брав участь у статичному тестуванні, виявляв і документував дефекти на ранніх стадіях розробки, що призвело до зниження витрат на обслуговування програмного забезпечення та покращення загальної якості",
          "softwareTesting": "Сприяв загальному покращенню якості програмного забезпечення шляхом виявлення дефектів і проблем, зменшення зусиль на тестування вручну та забезпечення своєчасної доставки високоякісних програмних продуктів"
        }
      },
      "certificates": {
        "title": "Сертифікати",
        "id": "Ідентифікатор",
        "skills": "Навички"
      }
    }
  },
  "blogPage": {
    "later_1": "Б",
    "title": "лог",
    "searchInputPlaceholder": "Пошук публікації...",
    "all": "Всі",
    "filterByTags": "Фільтрувати за тегами",
    "resetFilter": "Скинути фільтр",
    "allPosts": "Всі публікації",
    "noPosts": "Публікацій не знайдено."
  },
  "header": {
    "name": "Олександр Голишевський",
    "navItems": {
      "home": "Додому",
      "about": "Про мене",
      "blog": "Блог",
      "newPostBadge": "нове"
    }
  },
  "footer": {
    "powered": "Працює на",
    "deployed": "розгорнуто на",
    "designed": "розроблено за допомогою"
  },
  "postCards": {
    "minRead": "хв читання",
    "inThePost": "В публікації",
    "readMore": "Читати",
    "views": {
      "single": "перегляд",
      "plural": "переглядів"
    }
  },
  "postPage": {
    "tocHeader": "Зміст",
    "sharedLinks": "Поділитись в ",
    "copyLink": "Копіювати посилання",
    "later_1": "С",
    "relatedPosts": "хожі публікації",
    "backToHome": "Додому",
    "toTop": "Вверх"
  },
  "filteredPosts": {
    "later_1": "В",
    "title": "ідфільтровані публікації по: "
  },
  "metadata": {
    "homePage": "Олександр Голишевський",
    "aboutPage": "Про мене",
    "blogPage": "Блог",
    "filteredPage": "Всe по - {tag}"
  },
  "recommendations": {
    "title": "Рекомендації",
    "1st": {
      "name": "Денис Ганнич",
      "position": "Денис працював зі мною в одній команді"
    },
    "2nd": {
      "name": "Яна Кириченко",
      "position": "Яна керувала безпосередньо мною"
    },
    "3rd": {
      "name": "Андрій Єрмаков",
      "position": "Андрій звітував безпосередньо мені"
    }
  },
  "statistic": {
    "title": "Річна статистика",
    "bugReports": {
      "title": "Cтворені звіти про помилки", 
      "tooltip": "Помилки з виправленими дефектами"
    },
    "tasks": {
      "title": "Усього виконано завдань", 
      "tooltip": "Завдання перевірено/перевірено/здано"
    },
    "commits": {
      "title": "Кількість commit`ів", 
      "tooltip": "Коміти повідомлень у тестових фреймворках"
    },
    "tests": {
      "title": "Всього створено тестів", 
      "tooltip": "Завершені e2e/інтеграційні тести"
    }
  }
}